
import sqlite3

conn = sqlite3.connect('gifts.db')
c = conn.cursor()

c.execute('''CREATE TABLE IF NOT EXISTS gifts 
            (fio text, gift_name text, cost integer, status text)''')


gifts_data = [
    ("Людмила Александровна", "Санки", 2000, "куплен"),
    ("Ирина Сергеевна", "Цветы", 3000, "не куплен"),
    ("Алексей Петрович", "Книга", 1500, "не куплен"),
    ("Екатерина Васильева", "Музыкальный инструмент", 2500, "не куплен"),
    ("Николай Николаевич", "Шоколадки", 1000, "не куплен"),
    ("Валентина Михайловна", "Посуда", 1800, "не куплен"),
    ("Пётр Андреевич", "Кофемашина", 4000, "не куплен"),
    ("Лидия Алексеевна", "Техника для дома", 3500, "не куплен"),
    ("Геннадий Викторович", "Билеты на концерт", 5000, "не куплен"),
    ("Анастасия Александровна", "Косметика", 1200, "не куплен")
    ]

for row in gifts_data: c.execute("INSERT INTO gifts VALUES (?, ?, ?, ?)", row)

conn.commit()
conn.close()

